//A->AreaCode:地区代码
//N->Name:地区名称
//S->SpellCode:拼音
//L->Level:级别1省，2市，3，区
var ChineseAreas = [
    {
        "A": "340000",
        "L": 1,
        "N": "安徽省",
        "S": "ahs"
    },
    {
        "A": "820000",
        "L": 1,
        "N": "澳门特别行政区",
        "S": "amtbxzq"
    },
    {
        "A": "110000",
        "L": 1,
        "N": "北京市",
        "S": "bjs"
    },
    {
        "A": "500000",
        "L": 1,
        "N": "重庆市",
        "S": "cqs"
    },
    {
        "A": "350000",
        "L": 1,
        "N": "福建省",
        "S": "fjs"
    },
    {
        "A": "440000",
        "L": 1,
        "N": "广东省",
        "S": "gds"
    },
    {
        "A": "620000",
        "L": 1,
        "N": "甘肃省",
        "S": "gss"
    },
    {
        "A": "450000",
        "L": 1,
        "N": "广西壮族自治区",
        "S": "gxzzzzq"
    },
    {
        "A": "520000",
        "L": 1,
        "N": "贵州省",
        "S": "gzs"
    },
    {
        "A": "130000",
        "L": 1,
        "N": "河北省",
        "S": "hbs"
    },
    {
        "A": "420000",
        "L": 1,
        "N": "湖北省",
        "S": "hbs"
    },
    {
        "A": "230000",
        "L": 1,
        "N": "黑龙江省",
        "S": "hljs"
    },
    {
        "A": "410000",
        "L": 1,
        "N": "河南省",
        "S": "hns"
    },
    {
        "A": "430000",
        "L": 1,
        "N": "湖南省",
        "S": "hns"
    },
    {
        "A": "460000",
        "L": 1,
        "N": "海南省",
        "S": "hns"
    },
    {
        "A": "220000",
        "L": 1,
        "N": "吉林省",
        "S": "jls"
    },
    {
        "A": "320000",
        "L": 1,
        "N": "江苏省",
        "S": "jss"
    },
    {
        "A": "360000",
        "L": 1,
        "N": "江西省",
        "S": "jxs"
    },
    {
        "A": "210000",
        "L": 1,
        "N": "辽宁省",
        "S": "lns"
    },
    {
        "A": "150000",
        "L": 1,
        "N": "内蒙古自治区",
        "S": "nmgzzq"
    },
    {
        "A": "640000",
        "L": 1,
        "N": "宁夏回族自治区",
        "S": "nxhzzzq"
    },
    {
        "A": "630000",
        "L": 1,
        "N": "青海省",
        "S": "qhs"
    },
    {
        "A": "510000",
        "L": 1,
        "N": "四川省",
        "S": "scs"
    },
    {
        "A": "370000",
        "L": 1,
        "N": "山东省",
        "S": "sds"
    },
    {
        "A": "310000",
        "L": 1,
        "N": "上海市",
        "S": "shs"
    },
    {
        "A": "140000",
        "L": 1,
        "N": "山西省",
        "S": "sxs"
    },
    {
        "A": "610000",
        "L": 1,
        "N": "陕西省",
        "S": "sxs"
    },
    {
        "A": "120000",
        "L": 1,
        "N": "天津市",
        "S": "tjs"
    },
    {
        "A": "710000",
        "L": 1,
        "N": "台湾省",
        "S": "tws"
    },
    {
        "A": "540000",
        "L": 1,
        "N": "西藏自治区",
        "S": "xczzq"
    },
    {
        "A": "810000",
        "L": 1,
        "N": "香港特别行政区",
        "S": "xgtbxzq"
    },
    {
        "A": "650000",
        "L": 1,
        "N": "新疆维吾尔自治区",
        "S": "xjwwezzq"
    },
    {
        "A": "530000",
        "L": 1,
        "N": "云南省",
        "S": "yns"
    },
    {
        "A": "330000",
        "L": 1,
        "N": "浙江省",
        "S": "zjs"
    },
    {
        "A": "990000",
        "L": 1,
        "N": "海外-美国",
        "S": "hw"
    },
    {
        "A": "822000",
        "L": 2,
        "N": "氹仔岛",
        "S": "xh"
    },
    {
        "A": "513200",
        "L": 2,
        "N": "阿坝藏族羌族自治州",
        "S": "abczqzzzz"
    },
    {
        "A": "610900",
        "L": 2,
        "N": "安康市",
        "S": "aks"
    },
    {
        "A": "652900",
        "L": 2,
        "N": "阿克苏地区",
        "S": "aksdq"
    },
    {
        "A": "542500",
        "L": 2,
        "N": "阿里地区",
        "S": "aldq"
    },
    {
        "A": "152900",
        "L": 2,
        "N": "阿拉善盟",
        "S": "alsm"
    },
    {
        "A": "654300",
        "L": 2,
        "N": "阿勒泰地区",
        "S": "altdq"
    },
    {
        "A": "821000",
        "L": 2,
        "N": "澳门半岛",
        "S": "ambd"
    },
    {
        "A": "340800",
        "L": 2,
        "N": "安庆市",
        "S": "aqs"
    },
    {
        "A": "210300",
        "L": 2,
        "N": "鞍山市",
        "S": "ass"
    },
    {
        "A": "520400",
        "L": 2,
        "N": "安顺市",
        "S": "ass"
    },
    {
        "A": "410500",
        "L": 2,
        "N": "安阳市",
        "S": "ays"
    },
    {
        "A": "340300",
        "L": 2,
        "N": "蚌埠市",
        "S": "bbs"
    },
    {
        "A": "220800",
        "L": 2,
        "N": "白城市",
        "S": "bcs"
    },
    {
        "A": "130600",
        "L": 2,
        "N": "保定市",
        "S": "bds"
    },
    {
        "A": "652700",
        "L": 2,
        "N": "博尔塔拉蒙古自治州",
        "S": "betlmgzzz"
    },
    {
        "A": "450500",
        "L": 2,
        "N": "北海市",
        "S": "bhs"
    },
    {
        "A": "522400",
        "L": 2,
        "N": "毕节地区",
        "S": "bjdq"
    },
    {
        "A": "610300",
        "L": 2,
        "N": "宝鸡市",
        "S": "bjs"
    },
    {
        "A": "110000",
        "L": 2,
        "N": "北京市",
        "S": "bjs"
    },
    {
        "A": "220600",
        "L": 2,
        "N": "白山市",
        "S": "bss"
    },
    {
        "A": "451000",
        "L": 2,
        "N": "百色市",
        "S": "bss"
    },
    {
        "A": "530500",
        "L": 2,
        "N": "保山市",
        "S": "bss"
    },
    {
        "A": "150200",
        "L": 2,
        "N": "包头市",
        "S": "bts"
    },
    {
        "A": "210500",
        "L": 2,
        "N": "本溪市",
        "S": "bxs"
    },
    {
        "A": "652800",
        "L": 2,
        "N": "巴音郭楞蒙古自治州",
        "S": "byglmgzzz"
    },
    {
        "A": "150800",
        "L": 2,
        "N": "巴彦淖尔市",
        "S": "bynes"
    },
    {
        "A": "620400",
        "L": 2,
        "N": "白银市",
        "S": "bys"
    },
    {
        "A": "371600",
        "L": 2,
        "N": "滨州市",
        "S": "bzs"
    },
    {
        "A": "511900",
        "L": 2,
        "N": "巴中市",
        "S": "bzs"
    },
    {
        "A": "220100",
        "L": 2,
        "N": "长春市",
        "S": "ccs"
    },
    {
        "A": "542100",
        "L": 2,
        "N": "昌都地区",
        "S": "cddq"
    },
    {
        "A": "130800",
        "L": 2,
        "N": "承德市",
        "S": "cds"
    },
    {
        "A": "430700",
        "L": 2,
        "N": "常德市",
        "S": "cds"
    },
    {
        "A": "510100",
        "L": 2,
        "N": "成都市",
        "S": "cds"
    },
    {
        "A": "150400",
        "L": 2,
        "N": "赤峰市",
        "S": "cfs"
    },
    {
        "A": "341400",
        "L": 2,
        "N": "巢湖市",
        "S": "chs"
    },
    {
        "A": "652300",
        "L": 2,
        "N": "昌吉回族自治州",
        "S": "cjhzzzz"
    },
    {
        "A": "500000",
        "L": 2,
        "N": "重庆市",
        "S": "cqs"
    },
    {
        "A": "430100",
        "L": 2,
        "N": "长沙市",
        "S": "css"
    },
    {
        "A": "532300",
        "L": 2,
        "N": "楚雄彝族自治州",
        "S": "cxyzzzz"
    },
    {
        "A": "211300",
        "L": 2,
        "N": "朝阳市",
        "S": "cys"
    },
    {
        "A": "130900",
        "L": 2,
        "N": "沧州市",
        "S": "czs"
    },
    {
        "A": "140400",
        "L": 2,
        "N": "长治市",
        "S": "czs"
    },
    {
        "A": "320400",
        "L": 2,
        "N": "常州市",
        "S": "czs"
    },
    {
        "A": "341100",
        "L": 2,
        "N": "滁州市",
        "S": "czs"
    },
    {
        "A": "341700",
        "L": 2,
        "N": "池州市",
        "S": "czs"
    },
    {
        "A": "431000",
        "L": 2,
        "N": "郴州市",
        "S": "czs"
    },
    {
        "A": "445100",
        "L": 2,
        "N": "潮州市",
        "S": "czs"
    },
    {
        "A": "451400",
        "L": 2,
        "N": "崇左市",
        "S": "czs"
    },
    {
        "A": "210600",
        "L": 2,
        "N": "丹东市",
        "S": "dds"
    },
    {
        "A": "533100",
        "L": 2,
        "N": "德宏傣族景颇族自治州",
        "S": "dhdzjpzzzz"
    },
    {
        "A": "532900",
        "L": 2,
        "N": "大理白族自治州",
        "S": "dlbzzzz"
    },
    {
        "A": "210200",
        "L": 2,
        "N": "大连市",
        "S": "dls"
    },
    {
        "A": "533400",
        "L": 2,
        "N": "迪庆藏族自治州",
        "S": "dqczzzz"
    },
    {
        "A": "230600",
        "L": 2,
        "N": "大庆市",
        "S": "dqs"
    },
    {
        "A": "441900",
        "L": 2,
        "N": "东莞市",
        "S": "ds"
    },
    {
        "A": "140200",
        "L": 2,
        "N": "大同市",
        "S": "dts"
    },
    {
        "A": "232700",
        "L": 2,
        "N": "大兴安岭地区",
        "S": "dxaldq"
    },
    {
        "A": "621100",
        "L": 2,
        "N": "定西市",
        "S": "dxs"
    },
    {
        "A": "370500",
        "L": 2,
        "N": "东营市",
        "S": "dys"
    },
    {
        "A": "510600",
        "L": 2,
        "N": "德阳市",
        "S": "dys"
    },
    {
        "A": "371400",
        "L": 2,
        "N": "德州市",
        "S": "dzs"
    },
    {
        "A": "511700",
        "L": 2,
        "N": "达州市",
        "S": "dzs"
    },
    {
        "A": "150600",
        "L": 2,
        "N": "鄂尔多斯市",
        "S": "eedss"
    },
    {
        "A": "422800",
        "L": 2,
        "N": "恩施土家族苗族自治州",
        "S": "estjzmzzzz"
    },
    {
        "A": "420700",
        "L": 2,
        "N": "鄂州市",
        "S": "ezs"
    },
    {
        "A": "450600",
        "L": 2,
        "N": "防城港市",
        "S": "fcgs"
    },
    {
        "A": "210400",
        "L": 2,
        "N": "抚顺市",
        "S": "fss"
    },
    {
        "A": "440600",
        "L": 2,
        "N": "佛山市",
        "S": "fss"
    },
    {
        "A": "210900",
        "L": 2,
        "N": "阜新市",
        "S": "fxs"
    },
    {
        "A": "341200",
        "L": 2,
        "N": "阜阳市",
        "S": "fys"
    },
    {
        "A": "350100",
        "L": 2,
        "N": "福州市",
        "S": "fzs"
    },
    {
        "A": "361000",
        "L": 2,
        "N": "抚州市",
        "S": "fzs"
    },
    {
        "A": "511600",
        "L": 2,
        "N": "广安市",
        "S": "gas"
    },
    {
        "A": "450800",
        "L": 2,
        "N": "贵港市",
        "S": "ggs"
    },
    {
        "A": "632600",
        "L": 2,
        "N": "果洛藏族自治州",
        "S": "glczzzz"
    },
    {
        "A": "450300",
        "L": 2,
        "N": "桂林市",
        "S": "gls"
    },
    {
        "A": "623000",
        "L": 2,
        "N": "甘南藏族自治州",
        "S": "gnczzzz"
    },
    {
        "A": "713000",
        "L": 2,
        "N": "高雄市",
        "S": "gxs"
    },
    {
        "A": "510800",
        "L": 2,
        "N": "广元市",
        "S": "gys"
    },
    {
        "A": "520100",
        "L": 2,
        "N": "贵阳市",
        "S": "gys"
    },
    {
        "A": "640400",
        "L": 2,
        "N": "固原市",
        "S": "gys"
    },
    {
        "A": "513300",
        "L": 2,
        "N": "甘孜藏族自治州",
        "S": "gzczzzz"
    },
    {
        "A": "360700",
        "L": 2,
        "N": "赣州市",
        "S": "gzs"
    },
    {
        "A": "440100",
        "L": 2,
        "N": "广州市",
        "S": "gzs"
    },
    {
        "A": "320800",
        "L": 2,
        "N": "淮安市",
        "S": "has"
    },
    {
        "A": "632200",
        "L": 2,
        "N": "海北藏族自治州",
        "S": "hbczzzz"
    },
    {
        "A": "340600",
        "L": 2,
        "N": "淮北市",
        "S": "hbs"
    },
    {
        "A": "410600",
        "L": 2,
        "N": "鹤壁市",
        "S": "hbs"
    },
    {
        "A": "429000",
        "L": 2,
        "N": "湖北省直辖行政单位",
        "S": "hbszxxzdw"
    },
    {
        "A": "451200",
        "L": 2,
        "N": "河池市",
        "S": "hcs"
    },
    {
        "A": "632100",
        "L": 2,
        "N": "海东地区",
        "S": "hddq"
    },
    {
        "A": "130400",
        "L": 2,
        "N": "邯郸市",
        "S": "hds"
    },
    {
        "A": "230100",
        "L": 2,
        "N": "哈尔滨市",
        "S": "hebs"
    },
    {
        "A": "340100",
        "L": 2,
        "N": "合肥市",
        "S": "hfs"
    },
    {
        "A": "230400",
        "L": 2,
        "N": "鹤岗市",
        "S": "hgs"
    },
    {
        "A": "421100",
        "L": 2,
        "N": "黄冈市",
        "S": "hgs"
    },
    {
        "A": "532500",
        "L": 2,
        "N": "红河哈尼族彝族自治州",
        "S": "hhhnzyzzzz"
    },
    {
        "A": "150100",
        "L": 2,
        "N": "呼和浩特市",
        "S": "hhhts"
    },
    {
        "A": "231100",
        "L": 2,
        "N": "黑河市",
        "S": "hhs"
    },
    {
        "A": "431200",
        "L": 2,
        "N": "怀化市",
        "S": "hhs"
    },
    {
        "A": "460100",
        "L": 2,
        "N": "海口市",
        "S": "hks"
    },
    {
        "A": "150700",
        "L": 2,
        "N": "呼伦贝尔市",
        "S": "hlbes"
    },
    {
        "A": "211400",
        "L": 2,
        "N": "葫芦岛市",
        "S": "hlds"
    },
    {
        "A": "652200",
        "L": 2,
        "N": "哈密地区",
        "S": "hmdq"
    },
    {
        "A": "632300",
        "L": 2,
        "N": "黄南藏族自治州",
        "S": "hnczzzz"
    },
    {
        "A": "632500",
        "L": 2,
        "N": "海南藏族自治州",
        "S": "hnczzzz"
    },
    {
        "A": "340400",
        "L": 2,
        "N": "淮南市",
        "S": "hns"
    },
    {
        "A": "469000",
        "L": 2,
        "N": "海南省直辖县级行政单位",
        "S": "hnszxxjxzdw"
    },
    {
        "A": "411100",
        "L": 2,
        "N": "漯河市",
        "S": "hs"
    },
    {
        "A": "131100",
        "L": 2,
        "N": "衡水市",
        "S": "hss"
    },
    {
        "A": "341000",
        "L": 2,
        "N": "黄山市",
        "S": "hss"
    },
    {
        "A": "420200",
        "L": 2,
        "N": "黄石市",
        "S": "hss"
    },
    {
        "A": "653200",
        "L": 2,
        "N": "和田地区",
        "S": "htdq"
    },
    {
        "A": "632800",
        "L": 2,
        "N": "海西蒙古族藏族自治州",
        "S": "hxmgzczzzz"
    },
    {
        "A": "430400",
        "L": 2,
        "N": "衡阳市",
        "S": "hys"
    },
    {
        "A": "441600",
        "L": 2,
        "N": "河源市",
        "S": "hys"
    },
    {
        "A": "330100",
        "L": 2,
        "N": "杭州市",
        "S": "hzs"
    },
    {
        "A": "330500",
        "L": 2,
        "N": "湖州市",
        "S": "hzs"
    },
    {
        "A": "371700",
        "L": 2,
        "N": "荷泽市",
        "S": "hzs"
    },
    {
        "A": "441300",
        "L": 2,
        "N": "惠州市",
        "S": "hzs"
    },
    {
        "A": "451100",
        "L": 2,
        "N": "贺州市",
        "S": "hzs"
    },
    {
        "A": "610700",
        "L": 2,
        "N": "汉中市",
        "S": "hzs"
    },
    {
        "A": "360800",
        "L": 2,
        "N": "吉安市",
        "S": "jas"
    },
    {
        "A": "140500",
        "L": 2,
        "N": "晋城市",
        "S": "jcs"
    },
    {
        "A": "620300",
        "L": 2,
        "N": "金昌市",
        "S": "jcs"
    },
    {
        "A": "360200",
        "L": 2,
        "N": "景德镇市",
        "S": "jdzs"
    },
    {
        "A": "330700",
        "L": 2,
        "N": "金华市",
        "S": "jhs"
    },
    {
        "A": "360400",
        "L": 2,
        "N": "九江市",
        "S": "jjs"
    },
    {
        "A": "812000",
        "L": 2,
        "N": "九龙",
        "S": "jl"
    },
    {
        "A": "220200",
        "L": 2,
        "N": "吉林市",
        "S": "jls"
    },
    {
        "A": "420800",
        "L": 2,
        "N": "荆门市",
        "S": "jms"
    },
    {
        "A": "440700",
        "L": 2,
        "N": "江门市",
        "S": "jms"
    },
    {
        "A": "230800",
        "L": 2,
        "N": "佳木斯市",
        "S": "jmss"
    },
    {
        "A": "370100",
        "L": 2,
        "N": "济南市",
        "S": "jns"
    },
    {
        "A": "370800",
        "L": 2,
        "N": "济宁市",
        "S": "jns"
    },
    {
        "A": "620900",
        "L": 2,
        "N": "酒泉市",
        "S": "jqs"
    },
    {
        "A": "230300",
        "L": 2,
        "N": "鸡西市",
        "S": "jxs"
    },
    {
        "A": "330400",
        "L": 2,
        "N": "嘉兴市",
        "S": "jxs"
    },
    {
        "A": "620200",
        "L": 2,
        "N": "嘉峪关市",
        "S": "jygs"
    },
    {
        "A": "445200",
        "L": 2,
        "N": "揭阳市",
        "S": "jys"
    },
    {
        "A": "140700",
        "L": 2,
        "N": "晋中市",
        "S": "jzs"
    },
    {
        "A": "210700",
        "L": 2,
        "N": "锦州市",
        "S": "jzs"
    },
    {
        "A": "410800",
        "L": 2,
        "N": "焦作市",
        "S": "jzs"
    },
    {
        "A": "421000",
        "L": 2,
        "N": "荆州市",
        "S": "jzs"
    },
    {
        "A": "410200",
        "L": 2,
        "N": "开封市",
        "S": "kfs"
    },
    {
        "A": "650200",
        "L": 2,
        "N": "克拉玛依市",
        "S": "klmys"
    },
    {
        "A": "530100",
        "L": 2,
        "N": "昆明市",
        "S": "kms"
    },
    {
        "A": "653100",
        "L": 2,
        "N": "喀什地区",
        "S": "ksdq"
    },
    {
        "A": "653000",
        "L": 2,
        "N": "克孜勒苏柯尔克孜自治州",
        "S": "kzlskekzzzz"
    },
    {
        "A": "341500",
        "L": 2,
        "N": "六安市",
        "S": "las"
    },
    {
        "A": "451300",
        "L": 2,
        "N": "来宾市",
        "S": "lbs"
    },
    {
        "A": "371500",
        "L": 2,
        "N": "聊城市",
        "S": "lcs"
    },
    {
        "A": "530900",
        "L": 2,
        "N": "临沧市",
        "S": "lcs"
    },
    {
        "A": "431300",
        "L": 2,
        "N": "娄底市",
        "S": "lds"
    },
    {
        "A": "131000",
        "L": 2,
        "N": "廊坊市",
        "S": "lfs"
    },
    {
        "A": "141000",
        "L": 2,
        "N": "临汾市",
        "S": "lfs"
    },
    {
        "A": "823000",
        "L": 2,
        "N": "路环岛",
        "S": "lhd"
    },
    {
        "A": "530700",
        "L": 2,
        "N": "丽江市",
        "S": "ljs"
    },
    {
        "A": "141100",
        "L": 2,
        "N": "吕梁市",
        "S": "lls"
    },
    {
        "A": "621200",
        "L": 2,
        "N": "陇南市",
        "S": "lns"
    },
    {
        "A": "520200",
        "L": 2,
        "N": "六盘水市",
        "S": "lpss"
    },
    {
        "A": "331100",
        "L": 2,
        "N": "丽水市",
        "S": "lss"
    },
    {
        "A": "511100",
        "L": 2,
        "N": "乐山市",
        "S": "lss"
    },
    {
        "A": "540100",
        "L": 2,
        "N": "拉萨市",
        "S": "lss"
    },
    {
        "A": "513400",
        "L": 2,
        "N": "凉山彝族自治州",
        "S": "lsyzzzz"
    },
    {
        "A": "371200",
        "L": 2,
        "N": "莱芜市",
        "S": "lws"
    },
    {
        "A": "622900",
        "L": 2,
        "N": "临夏回族自治州",
        "S": "lxhzzzz"
    },
    {
        "A": "320700",
        "L": 2,
        "N": "连云港市",
        "S": "lygs"
    },
    {
        "A": "211000",
        "L": 2,
        "N": "辽阳市",
        "S": "lys"
    },
    {
        "A": "220400",
        "L": 2,
        "N": "辽源市",
        "S": "lys"
    },
    {
        "A": "350800",
        "L": 2,
        "N": "龙岩市",
        "S": "lys"
    },
    {
        "A": "371300",
        "L": 2,
        "N": "临沂市",
        "S": "lys"
    },
    {
        "A": "410300",
        "L": 2,
        "N": "洛阳市",
        "S": "lys"
    },
    {
        "A": "542600",
        "L": 2,
        "N": "林芝地区",
        "S": "lzdq"
    },
    {
        "A": "450200",
        "L": 2,
        "N": "柳州市",
        "S": "lzs"
    },
    {
        "A": "620100",
        "L": 2,
        "N": "兰州市",
        "S": "lzs"
    },
    {
        "A": "340500",
        "L": 2,
        "N": "马鞍山市",
        "S": "mass"
    },
    {
        "A": "231000",
        "L": 2,
        "N": "牡丹江市",
        "S": "mdjs"
    },
    {
        "A": "440900",
        "L": 2,
        "N": "茂名市",
        "S": "mms"
    },
    {
        "A": "511400",
        "L": 2,
        "N": "眉山市",
        "S": "mss"
    },
    {
        "A": "510700",
        "L": 2,
        "N": "绵阳市",
        "S": "mys"
    },
    {
        "A": "441400",
        "L": 2,
        "N": "梅州市",
        "S": "mzs"
    },
    {
        "A": "330200",
        "L": 2,
        "N": "宁波市",
        "S": "nbs"
    },
    {
        "A": "360100",
        "L": 2,
        "N": "南昌市",
        "S": "ncs"
    },
    {
        "A": "511300",
        "L": 2,
        "N": "南充市",
        "S": "ncs"
    },
    {
        "A": "350900",
        "L": 2,
        "N": "宁德市",
        "S": "nds"
    },
    {
        "A": "533300",
        "L": 2,
        "N": "怒江傈僳族自治州",
        "S": "njlszzzz"
    },
    {
        "A": "320100",
        "L": 2,
        "N": "南京市",
        "S": "njs"
    },
    {
        "A": "511000",
        "L": 2,
        "N": "内江市",
        "S": "njs"
    },
    {
        "A": "450100",
        "L": 2,
        "N": "南宁市",
        "S": "nns"
    },
    {
        "A": "350700",
        "L": 2,
        "N": "南平市",
        "S": "nps"
    },
    {
        "A": "542400",
        "L": 2,
        "N": "那曲地区",
        "S": "nqdq"
    },
    {
        "A": "320600",
        "L": 2,
        "N": "南通市",
        "S": "nts"
    },
    {
        "A": "411300",
        "L": 2,
        "N": "南阳市",
        "S": "nys"
    },
    {
        "A": "410400",
        "L": 2,
        "N": "平顶山市",
        "S": "pdss"
    },
    {
        "A": "211100",
        "L": 2,
        "N": "盘锦市",
        "S": "pjs"
    },
    {
        "A": "620800",
        "L": 2,
        "N": "平凉市",
        "S": "pls"
    },
    {
        "A": "350300",
        "L": 2,
        "N": "莆田市",
        "S": "pts"
    },
    {
        "A": "360300",
        "L": 2,
        "N": "萍乡市",
        "S": "pxs"
    },
    {
        "A": "510400",
        "L": 2,
        "N": "攀枝花市",
        "S": "pzhs"
    },
    {
        "A": "522600",
        "L": 2,
        "N": "黔东南苗族侗族自治州",
        "S": "qdnmzdzzzz"
    },
    {
        "A": "370200",
        "L": 2,
        "N": "青岛市",
        "S": "qds"
    },
    {
        "A": "130300",
        "L": 2,
        "N": "秦皇岛市",
        "S": "qhds"
    },
    {
        "A": "530300",
        "L": 2,
        "N": "曲靖市",
        "S": "qjs"
    },
    {
        "A": "522700",
        "L": 2,
        "N": "黔南布依族苗族自治州",
        "S": "qnbyzmzzzz"
    },
    {
        "A": "230200",
        "L": 2,
        "N": "齐齐哈尔市",
        "S": "qqhes"
    },
    {
        "A": "230900",
        "L": 2,
        "N": "七台河市",
        "S": "qths"
    },
    {
        "A": "522300",
        "L": 2,
        "N": "黔西南布依族苗族自治州",
        "S": "qxnbyzmzzzz"
    },
    {
        "A": "441800",
        "L": 2,
        "N": "清远市",
        "S": "qys"
    },
    {
        "A": "621000",
        "L": 2,
        "N": "庆阳市",
        "S": "qys"
    },
    {
        "A": "350500",
        "L": 2,
        "N": "泉州市",
        "S": "qzs"
    },
    {
        "A": "450700",
        "L": 2,
        "N": "钦州市",
        "S": "qzs"
    },
    {
        "A": "542300",
        "L": 2,
        "N": "日喀则地区",
        "S": "rkzdq"
    },
    {
        "A": "371100",
        "L": 2,
        "N": "日照市",
        "S": "rzs"
    },
    {
        "A": "440200",
        "L": 2,
        "N": "韶关市",
        "S": "sgs"
    },
    {
        "A": "231200",
        "L": 2,
        "N": "绥化市",
        "S": "shs"
    },
    {
        "A": "310000",
        "L": 2,
        "N": "上海市",
        "S": "shs"
    },
    {
        "A": "130100",
        "L": 2,
        "N": "石家庄市",
        "S": "sjzs"
    },
    {
        "A": "611000",
        "L": 2,
        "N": "商洛市",
        "S": "sls"
    },
    {
        "A": "350400",
        "L": 2,
        "N": "三明市",
        "S": "sms"
    },
    {
        "A": "530800",
        "L": 2,
        "N": "思茅市",
        "S": "sms"
    },
    {
        "A": "411200",
        "L": 2,
        "N": "三门峡市",
        "S": "smxs"
    },
    {
        "A": "542200",
        "L": 2,
        "N": "山南地区",
        "S": "sndq"
    },
    {
        "A": "510900",
        "L": 2,
        "N": "遂宁市",
        "S": "sns"
    },
    {
        "A": "220300",
        "L": 2,
        "N": "四平市",
        "S": "sps"
    },
    {
        "A": "321300",
        "L": 2,
        "N": "宿迁市",
        "S": "sqs"
    },
    {
        "A": "411400",
        "L": 2,
        "N": "商丘市",
        "S": "sqs"
    },
    {
        "A": "361100",
        "L": 2,
        "N": "上饶市",
        "S": "srs"
    },
    {
        "A": "440300",
        "L": 2,
        "N": "深圳市",
        "S": "ss"
    },
    {
        "A": "440500",
        "L": 2,
        "N": "汕头市",
        "S": "sts"
    },
    {
        "A": "441500",
        "L": 2,
        "N": "汕尾市",
        "S": "sws"
    },
    {
        "A": "330600",
        "L": 2,
        "N": "绍兴市",
        "S": "sxs"
    },
    {
        "A": "210100",
        "L": 2,
        "N": "沈阳市",
        "S": "sys"
    },
    {
        "A": "220700",
        "L": 2,
        "N": "松原市",
        "S": "sys"
    },
    {
        "A": "420300",
        "L": 2,
        "N": "十堰市",
        "S": "sys"
    },
    {
        "A": "430500",
        "L": 2,
        "N": "邵阳市",
        "S": "sys"
    },
    {
        "A": "460200",
        "L": 2,
        "N": "三亚市",
        "S": "sys"
    },
    {
        "A": "230500",
        "L": 2,
        "N": "双鸭山市",
        "S": "syss"
    },
    {
        "A": "140600",
        "L": 2,
        "N": "朔州市",
        "S": "szs"
    },
    {
        "A": "320500",
        "L": 2,
        "N": "苏州市",
        "S": "szs"
    },
    {
        "A": "341300",
        "L": 2,
        "N": "宿州市",
        "S": "szs"
    },
    {
        "A": "421300",
        "L": 2,
        "N": "随州市",
        "S": "szs"
    },
    {
        "A": "640200",
        "L": 2,
        "N": "石嘴山市",
        "S": "szss"
    },
    {
        "A": "370900",
        "L": 2,
        "N": "泰安市",
        "S": "tas"
    },
    {
        "A": "712000",
        "L": 2,
        "N": "台北市",
        "S": "tbs"
    },
    {
        "A": "654200",
        "L": 2,
        "N": "塔城地区",
        "S": "tcdq"
    },
    {
        "A": "610200",
        "L": 2,
        "N": "铜川市",
        "S": "tcs"
    },
    {
        "A": "220500",
        "L": 2,
        "N": "通化市",
        "S": "ths"
    },
    {
        "A": "120000",
        "L": 2,
        "N": "天津市",
        "S": "tjs"
    },
    {
        "A": "652100",
        "L": 2,
        "N": "吐鲁番地区",
        "S": "tlfdq"
    },
    {
        "A": "150500",
        "L": 2,
        "N": "通辽市",
        "S": "tls"
    },
    {
        "A": "211200",
        "L": 2,
        "N": "铁岭市",
        "S": "tls"
    },
    {
        "A": "340700",
        "L": 2,
        "N": "铜陵市",
        "S": "tls"
    },
    {
        "A": "522200",
        "L": 2,
        "N": "铜仁地区",
        "S": "trdq"
    },
    {
        "A": "130200",
        "L": 2,
        "N": "唐山市",
        "S": "tss"
    },
    {
        "A": "620500",
        "L": 2,
        "N": "天水市",
        "S": "tss"
    },
    {
        "A": "711000",
        "L": 2,
        "N": "台湾省",
        "S": "tws"
    },
    {
        "A": "140100",
        "L": 2,
        "N": "太原市",
        "S": "tys"
    },
    {
        "A": "321200",
        "L": 2,
        "N": "泰州市",
        "S": "tzs"
    },
    {
        "A": "331000",
        "L": 2,
        "N": "台州市",
        "S": "tzs"
    },
    {
        "A": "370700",
        "L": 2,
        "N": "潍坊市",
        "S": "wfs"
    },
    {
        "A": "150300",
        "L": 2,
        "N": "乌海市",
        "S": "whs"
    },
    {
        "A": "340200",
        "L": 2,
        "N": "芜湖市",
        "S": "whs"
    },
    {
        "A": "371000",
        "L": 2,
        "N": "威海市",
        "S": "whs"
    },
    {
        "A": "420100",
        "L": 2,
        "N": "武汉市",
        "S": "whs"
    },
    {
        "A": "150900",
        "L": 2,
        "N": "乌兰察布市",
        "S": "wlcbs"
    },
    {
        "A": "650100",
        "L": 2,
        "N": "乌鲁木齐市",
        "S": "wlmqs"
    },
    {
        "A": "610500",
        "L": 2,
        "N": "渭南市",
        "S": "wns"
    },
    {
        "A": "532600",
        "L": 2,
        "N": "文山壮族苗族自治州",
        "S": "wszzmzzzz"
    },
    {
        "A": "620600",
        "L": 2,
        "N": "武威市",
        "S": "wws"
    },
    {
        "A": "320200",
        "L": 2,
        "N": "无锡市",
        "S": "wxs"
    },
    {
        "A": "330300",
        "L": 2,
        "N": "温州市",
        "S": "wzs"
    },
    {
        "A": "450400",
        "L": 2,
        "N": "梧州市",
        "S": "wzs"
    },
    {
        "A": "640300",
        "L": 2,
        "N": "吴忠市",
        "S": "wzs"
    },
    {
        "A": "152200",
        "L": 2,
        "N": "兴安盟",
        "S": "xam"
    },
    {
        "A": "610100",
        "L": 2,
        "N": "西安市",
        "S": "xas"
    },
    {
        "A": "341800",
        "L": 2,
        "N": "宣城市",
        "S": "xcs"
    },
    {
        "A": "411000",
        "L": 2,
        "N": "许昌市",
        "S": "xcs"
    },
    {
        "A": "420600",
        "L": 2,
        "N": "襄樊市",
        "S": "xfs"
    },
    {
        "A": "811000",
        "L": 2,
        "N": "香港岛",
        "S": "xgd"
    },
    {
        "A": "420900",
        "L": 2,
        "N": "孝感市",
        "S": "xgs"
    },
    {
        "A": "813000",
        "L": 2,
        "N": "新界东",
        "S": "xjd"
    },
    {
        "A": "659000",
        "L": 2,
        "N": "新疆维吾尔自治区直辖行政单位",
        "S": "xjwwezzqzxxzdw"
    },
    {
        "A": "814000",
        "L": 2,
        "N": "新界西",
        "S": "xjx"
    },
    {
        "A": "152500",
        "L": 2,
        "N": "锡林郭勒盟",
        "S": "xlglm"
    },
    {
        "A": "350200",
        "L": 2,
        "N": "厦门市",
        "S": "xms"
    },
    {
        "A": "421200",
        "L": 2,
        "N": "咸宁市",
        "S": "xns"
    },
    {
        "A": "630100",
        "L": 2,
        "N": "西宁市",
        "S": "xns"
    },
    {
        "A": "532800",
        "L": 2,
        "N": "西双版纳傣族自治州",
        "S": "xsbndzzzz"
    },
    {
        "A": "130500",
        "L": 2,
        "N": "邢台市",
        "S": "xts"
    },
    {
        "A": "430300",
        "L": 2,
        "N": "湘潭市",
        "S": "xts"
    },
    {
        "A": "410700",
        "L": 2,
        "N": "新乡市",
        "S": "xxs"
    },
    {
        "A": "433100",
        "L": 2,
        "N": "湘西土家族苗族自治州",
        "S": "xxtjzmzzzz"
    },
    {
        "A": "360500",
        "L": 2,
        "N": "新余市",
        "S": "xys"
    },
    {
        "A": "411500",
        "L": 2,
        "N": "信阳市",
        "S": "xys"
    },
    {
        "A": "610400",
        "L": 2,
        "N": "咸阳市",
        "S": "xys"
    },
    {
        "A": "140900",
        "L": 2,
        "N": "忻州市",
        "S": "xzs"
    },
    {
        "A": "320300",
        "L": 2,
        "N": "徐州市",
        "S": "xzs"
    },
    {
        "A": "511800",
        "L": 2,
        "N": "雅安市",
        "S": "yas"
    },
    {
        "A": "610600",
        "L": 2,
        "N": "延安市",
        "S": "yas"
    },
    {
        "A": "222400",
        "L": 2,
        "N": "延边朝鲜族自治州",
        "S": "ybcxzzzz"
    },
    {
        "A": "511500",
        "L": 2,
        "N": "宜宾市",
        "S": "ybs"
    },
    {
        "A": "140800",
        "L": 2,
        "N": "运城市",
        "S": "ycs"
    },
    {
        "A": "230700",
        "L": 2,
        "N": "伊春市",
        "S": "ycs"
    },
    {
        "A": "320900",
        "L": 2,
        "N": "盐城市",
        "S": "ycs"
    },
    {
        "A": "360900",
        "L": 2,
        "N": "宜春市",
        "S": "ycs"
    },
    {
        "A": "420500",
        "L": 2,
        "N": "宜昌市",
        "S": "ycs"
    },
    {
        "A": "640100",
        "L": 2,
        "N": "银川市",
        "S": "ycs"
    },
    {
        "A": "445300",
        "L": 2,
        "N": "云浮市",
        "S": "yfs"
    },
    {
        "A": "441700",
        "L": 2,
        "N": "阳江市",
        "S": "yjs"
    },
    {
        "A": "210800",
        "L": 2,
        "N": "营口市",
        "S": "yks"
    },
    {
        "A": "654000",
        "L": 2,
        "N": "伊犁哈萨克自治州",
        "S": "ylhskzzz"
    },
    {
        "A": "450900",
        "L": 2,
        "N": "玉林市",
        "S": "yls"
    },
    {
        "A": "610800",
        "L": 2,
        "N": "榆林市",
        "S": "yls"
    },
    {
        "A": "140300",
        "L": 2,
        "N": "阳泉市",
        "S": "yqs"
    },
    {
        "A": "410900",
        "L": 2,
        "N": "濮阳市",
        "S": "ys"
    },
    {
        "A": "632700",
        "L": 2,
        "N": "玉树藏族自治州",
        "S": "ysczzzz"
    },
    {
        "A": "360600",
        "L": 2,
        "N": "鹰潭市",
        "S": "yts"
    },
    {
        "A": "370600",
        "L": 2,
        "N": "烟台市",
        "S": "yts"
    },
    {
        "A": "530400",
        "L": 2,
        "N": "玉溪市",
        "S": "yxs"
    },
    {
        "A": "430600",
        "L": 2,
        "N": "岳阳市",
        "S": "yys"
    },
    {
        "A": "430900",
        "L": 2,
        "N": "益阳市",
        "S": "yys"
    },
    {
        "A": "321000",
        "L": 2,
        "N": "扬州市",
        "S": "yzs"
    },
    {
        "A": "431100",
        "L": 2,
        "N": "永州市",
        "S": "yzs"
    },
    {
        "A": "370300",
        "L": 2,
        "N": "淄博市",
        "S": "zbs"
    },
    {
        "A": "510300",
        "L": 2,
        "N": "自贡市",
        "S": "zgs"
    },
    {
        "A": "440400",
        "L": 2,
        "N": "珠海市",
        "S": "zhs"
    },
    {
        "A": "430800",
        "L": 2,
        "N": "张家界市",
        "S": "zjjs"
    },
    {
        "A": "130700",
        "L": 2,
        "N": "张家口市",
        "S": "zjks"
    },
    {
        "A": "321100",
        "L": 2,
        "N": "镇江市",
        "S": "zjs"
    },
    {
        "A": "440800",
        "L": 2,
        "N": "湛江市",
        "S": "zjs"
    },
    {
        "A": "411600",
        "L": 2,
        "N": "周口市",
        "S": "zks"
    },
    {
        "A": "411700",
        "L": 2,
        "N": "驻马店市",
        "S": "zmds"
    },
    {
        "A": "441200",
        "L": 2,
        "N": "肇庆市",
        "S": "zqs"
    },
    {
        "A": "330800",
        "L": 2,
        "N": "衢州市",
        "S": "zs"
    },
    {
        "A": "341600",
        "L": 2,
        "N": "亳州市",
        "S": "zs"
    },
    {
        "A": "510500",
        "L": 2,
        "N": "泸州市",
        "S": "zs"
    },
    {
        "A": "330900",
        "L": 2,
        "N": "舟山市",
        "S": "zss"
    },
    {
        "A": "442000",
        "L": 2,
        "N": "中山市",
        "S": "zss"
    },
    {
        "A": "530600",
        "L": 2,
        "N": "昭通市",
        "S": "zts"
    },
    {
        "A": "640500",
        "L": 2,
        "N": "中卫市",
        "S": "zws"
    },
    {
        "A": "512000",
        "L": 2,
        "N": "资阳市",
        "S": "zys"
    },
    {
        "A": "520300",
        "L": 2,
        "N": "遵义市",
        "S": "zys"
    },
    {
        "A": "620700",
        "L": 2,
        "N": "张掖市",
        "S": "zys"
    },
    {
        "A": "350600",
        "L": 2,
        "N": "漳州市",
        "S": "zzs"
    },
    {
        "A": "370400",
        "L": 2,
        "N": "枣庄市",
        "S": "zzs"
    },
    {
        "A": "410100",
        "L": 2,
        "N": "郑州市",
        "S": "zzs"
    },
    {
        "A": "430200",
        "L": 2,
        "N": "株洲市",
        "S": "zzs"
    },
    {
        "A": "990100",
        "L": 2,
        "N": "美国",
        "S": "美国"
    }
];

function checkAreaCode(areaCode) {
    if (!areaCode || areaCode.length != 6)
        return false;
    return true;
    //    var testReg = /^\d{6}$/;
    //    if (testReg.test(areaCode)) return true;
    //    return false;
}
function AreaModel(areaCode, name, level, spellCode) {
    this.AreaCode = areaCode;
    this.Name = name;
    this.Level = level;
    this.SpellCode = spellCode;
}
function buildAreaModel(obj) {
    return new AreaModel(obj.A, obj.N, obj.L, obj.S);
}
//根据地区code获取地区信息
//return AreaCode、Name、Level、SpellCode
function getAreaInfoByCode(areaCode) {
    var result = {};

    if (!checkAreaCode(areaCode)) {
        return result;
    }
    for (var i = 0; i < ChineseAreas.length; i++) {
        if (areaCode == ChineseAreas[i].A) {
            return buildAreaModel(ChineseAreas[i]);
        }
    }
    return result;
}
//获取所有城市信息
//return AreaCode、Name、Level、SpellCode
function getAllCities() {
    var arr = [];
    for (var i = 0; i < ChineseAreas.length; i++) {
        if (ChineseAreas[i].L == 2) {
            arr.push(buildAreaModel(ChineseAreas[i]));
        }
    }
    return arr;
}

//获取所有省级信息
//return AreaCode、Name、Level、SpellCode
function getAllProvinces() {
    var arr = [];
    for (var i = 0; i < ChineseAreas.length; i++) {
        if (ChineseAreas[i].L == 1) {
            arr.push(buildAreaModel(ChineseAreas[i]));
        }
    }
    return arr;
}

//根据城市代码获取所在省信息
//return AreaCode、Name、Level、SpellCode
function getProvinceByCityCode(areaCode) {
    var result = {};
    if (!checkAreaCode(areaCode)) {
        return result;
    }
    var provinceCode = areaCode.substr(0, 2) + "0000";
    for (var i = 0; i < ChineseAreas.length; i++) {
        if (ChineseAreas[i].A == provinceCode) {
            return buildAreaModel(ChineseAreas[i]);
        }
    }
    return result;
}

//根据省代码获取辖区内所有城市信息
//return AreaCode、Name、Level、SpellCode
function getProvinceCities(provinceCode) {
    var cities = [];
    if (!checkAreaCode(provinceCode)) {
        return cities;
    }
    var provinceCodeSub = provinceCode.substr(0, 2);
    for (var i = 0; i < ChineseAreas.length; i++) {
        if (ChineseAreas[i].L == 2 && ChineseAreas[i].A.substr(0, 2) == provinceCodeSub) {
            cities.push(buildAreaModel(ChineseAreas[i]));
        }
    }
    return cities;
}
function getCityCode(cityName) {
    var cityCode = '';
    var allCities = [];
    allCities = getAllCities();
    for (var i = 0, n = allCities.length; i < n; i++) {
        if (cityName == allCities[i].Name) {
            cityCode = allCities[i].AreaCode;
        }
    }
    return cityCode;
}